Repository: isantolin/arduino-yun-bridge2
Catalog: luci-app-yunbridge/i18n/yunbridge.*.po
Languages: es

source: YunBridge Configuration
es: Configuración de YunBridge

source: Main Settings
es: Configuración Principal

source: MQTT Host
es: Servidor MQTT

source: MQTT Port
es: Puerto MQTT

source: MQTT Topic Prefix
es: Prefijo de Tópico MQTT

source: Serial Port
es: Puerto Serie

source: Serial Baudrate
es: Baudios del Puerto Serie

source: Debug Mode
es: Modo Depuración

source: Daemon Status
es: Estado del Daemon

source: Recent Log Output
es: Salida Reciente del Log

source: Web UI
es: Interfaz Web

source: MQTT WebSocket Port
es: Puerto WebSocket MQTT

source: Strongly recommended. Disabling TLS sends MQTT credentials and payloads in plaintext.
es: Muy recomendado. Si desactivas TLS las credenciales y cargas MQTT viajarán en texto plano.

source: Serial Shared Secret
es: Secreto Compartido Serial

source: Shared secret used to authenticate the MCU handshake. Must match the firmware and be at least 8 characters long.
es: Secreto compartido para autenticar el handshake con el MCU. Debe coincidir con el firmware y tener al menos 8 caracteres.

source: Arduino Secret Template
es: Plantilla de secreto para Arduino

source: Paste this snippet into your sketch (before including Bridge.h) so the MCU matches the new daemon secret.
es: Pega este snippet al inicio de tu sketch (antes de incluir Bridge.h) para que el MCU coincida con el nuevo secreto del daemon.

source: Copy snippet
es: Copiar snippet

source: Safe Serial Baud Rate
es: Velocidad Serial Segura

source: Initial baudrate for negotiation. Use 115200 for safety.
es: Velocidad inicial para negociación. Use 115200 por seguridad.

source: Status snapshot is read from /tmp/yunbridge_status.json (tmpfs) and may be empty after reboot or while the daemon is starting.
es: El estado se lee desde /tmp/yunbridge_status.json (tmpfs) y puede estar vacío después de reiniciar o mientras el daemon está iniciando.

source: Configure the YunBridge daemon which proxies RPC frames between the MCU and MQTT. Runtime status snapshots are written to /tmp/yunbridge_status.json (tmpfs) and are cleared on reboot.
es: Configura el daemon YunBridge que actúa como proxy de tramas RPC entre el MCU y MQTT. Los snapshots de estado se escriben en /tmp/yunbridge_status.json (tmpfs) y se borran al reiniciar.

source: Daemon Settings
es: Configuración del Daemon

source: Enable Daemon
es: Habilitar Daemon

source: Enable Debug Logging
es: Habilitar Logs de Depuración

source: Serial Baud Rate
es: Velocidad (Baudios) del Puerto Serie

source: MQTT Username
es: Usuario MQTT

source: MQTT Password
es: Contraseña MQTT

source: Enable TLS/SSL
es: Habilitar TLS/SSL

source: CA File Path
es: Ruta del archivo CA

source: CA file is required when TLS is enabled.
es: El archivo CA es obligatorio cuando TLS está habilitado.

source: Client Certificate Path
es: Ruta del certificado del cliente

source: Client Key Path
es: Ruta de la clave del cliente

source: Base topic used for bridge messages (for example br/d/<pin>).
es: Tópico base usado para los mensajes del bridge (por ejemplo br/d/<pin>).

source: Topic prefix cannot be empty.
es: El prefijo de tópico no puede estar vacío.

source: Topic prefix cannot contain MQTT wildcards.
es: El prefijo de tópico no puede contener comodines de MQTT.

source: MQTT Spool Directory
es: Directorio de spool MQTT

source: Directory used to spool MQTT messages when the broker is unavailable. Keep this on /tmp (tmpfs) or an external mount to avoid Flash wear.
es: Directorio usado para encolar (spool) mensajes MQTT cuando el broker no está disponible. Mantén esto en /tmp (tmpfs) o en un montaje externo para evitar desgaste de la Flash.

source: Spool directory cannot be empty.
es: El directorio de spool no puede estar vacío.

source: Spool directory must be an absolute path.
es: El directorio de spool debe ser una ruta absoluta.

source: For Flash safety, use a path under /tmp, /run, /var/run, or /mnt.
es: Por seguridad de la Flash, usa una ruta bajo /tmp, /run, /var/run o /mnt.

source: File System Root
es: Raíz del sistema de archivos

source: Directory exposed for MCU file operations. Use /tmp for tmpfs (Flash-safe) or /mnt/<device> for external storage.
es: Directorio expuesto para operaciones de archivos del MCU. Usa /tmp como tmpfs (seguro para Flash) o /mnt/<dispositivo> para almacenamiento externo.

source: Process Timeout (s)
es: Timeout de procesos (s)

source: Allowed Shell Commands
es: Comandos de shell permitidos

source: Space separated whitelist for shell execution (leave empty to disable).
es: Lista blanca separada por espacios para ejecución en shell (dejar vacío para desactivar).

source: Allow file reads
es: Permitir lectura de archivos

source: Accept MQTT requests that read files via br/fs/read.
es: Aceptar solicitudes MQTT que leen archivos vía br/fs/read.

source: Allow file writes
es: Permitir escritura de archivos

source: Accept MQTT requests that write files via br/fs/write.
es: Aceptar solicitudes MQTT que escriben archivos vía br/fs/write.

source: Allow file deletes
es: Permitir borrado de archivos

source: Accept MQTT requests that delete files via br/fs/remove.
es: Aceptar solicitudes MQTT que borran archivos vía br/fs/remove.

source: Allow datastore get
es: Permitir lectura de datastore

source: Allow clients to read key/value pairs via br/datastore/get.
es: Permitir a los clientes leer pares clave/valor vía br/datastore/get.

source: Allow datastore put
es: Permitir escritura de datastore

source: Allow clients to modify key/value pairs via br/datastore/put.
es: Permitir a los clientes modificar pares clave/valor vía br/datastore/put.

source: Allow mailbox read
es: Permitir lectura de mailbox

source: Permit MQTT reads from the MCU mailbox.
es: Permitir lecturas MQTT desde el mailbox del MCU.

source: Allow mailbox write
es: Permitir escritura de mailbox

source: Permit MQTT writes into the MCU mailbox queue.
es: Permitir escrituras MQTT en la cola de mailbox del MCU.

source: Allow shell run
es: Permitir shell run

source: Allow synchronous shell execution via br/sh/run.
es: Permitir ejecución síncrona de shell vía br/sh/run.

source: Allow shell run_async
es: Permitir shell run_async

source: Allow asynchronous shell execution via br/sh/run_async.
es: Permitir ejecución asíncrona de shell vía br/sh/run_async.

source: Allow shell poll
es: Permitir shell poll

source: Allow polling of asynchronous shell jobs via br/sh/poll.
es: Permitir consultar trabajos asíncronos de shell vía br/sh/poll.

source: Allow shell kill
es: Permitir shell kill

source: Allow canceling asynchronous shell jobs via br/sh/kill.
es: Permitir cancelar trabajos asíncronos de shell vía br/sh/kill.

source: Allow console input
es: Permitir entrada de consola

source: Permit MQTT writes to br/console/in to reach the MCU console.
es: Permitir escrituras MQTT a br/console/in para llegar a la consola del MCU.

source: Allow digital write
es: Permitir escritura digital

source: Allow MQTT writes to br/d/<pin>/write.
es: Permitir escrituras MQTT a br/d/<pin>/write.

source: Allow digital read
es: Permitir lectura digital

source: Allow MQTT reads via br/d/<pin>/read.
es: Permitir lecturas MQTT vía br/d/<pin>/read.

source: Allow digital mode
es: Permitir modo digital

source: Allow MQTT access to br/d/<pin>/mode.
es: Permitir acceso MQTT a br/d/<pin>/mode.

source: Allow analog write
es: Permitir escritura analógica

source: Allow MQTT writes to br/a/<pin>/write.
es: Permitir escrituras MQTT a br/a/<pin>/write.

source: Allow analog read
es: Permitir lectura analógica

source: Allow MQTT reads via br/a/<pin>/read.
es: Permitir lecturas MQTT vía br/a/<pin>/read.

source: Managed via UCI. Use the Credentials & TLS tab to rotate secrets.
es: Gestionado vía UCI. Usa la pestaña Credenciales y TLS para rotar secretos.

source: Credentials & TLS
es: Credenciales y TLS

source: Manage shared secrets and TLS material without leaving LuCI.
es: Gestiona secretos compartidos y material TLS sin salir de LuCI.

source: Rotate Credentials
es: Rotar credenciales

source: This regenerates YUNBRIDGE_SERIAL_SECRET and the MQTT password, writes them to UCI, and restarts the daemon.
es: Esto regenera YUNBRIDGE_SERIAL_SECRET y la contraseña MQTT, las escribe en UCI y reinicia el daemon.

source: Rotate now
es: Rotar ahora

source: TLS Material
es: Material TLS

source: Upload new CA/certificate/key files via SCP or the provided helper:
es: Sube nuevos archivos CA/certificado/clave vía SCP o usando el helper provisto:

source: Point the daemon to the new paths using the main configuration page.
es: Indica al daemon las nuevas rutas usando la página principal de configuración.

source: Hardware Smoke Test
es: Smoke test de hardware

source: Runs /usr/bin/yunbridge-hw-smoke to verify MQTT round trips and service health.
es: Ejecuta /usr/bin/yunbridge-hw-smoke para verificar round trips MQTT y la salud del servicio.

source: Run smoke test
es: Ejecutar smoke test

source: Running...
es: Ejecutando...

source: No status available
es: No hay estado disponible

source: Error processing data.
es: Error procesando datos.

source: YunBridge Daemon Status
es: Estado del daemon YunBridge

source: Loading status...
es: Cargando estado...
